---
kind: method
id: M:Autodesk.Revit.DB.TextNoteOptions.Dispose
source: html/0cdca35d-7701-6edc-5de5-c778c383a0c1.htm
---
# Autodesk.Revit.DB.TextNoteOptions.Dispose Method

Releases all resources used by the TextNoteOptions

## Syntax (C#)
```csharp
public void Dispose()
```